
from quiz import Quiz


def get_default_questions():
    return [
        Quiz(
            "고조선을 건국했다고 전해지는 인물은 누구일까요?",
            ["주몽", "단군왕검", "박혁거세", "온조"],
            2
        ),
        Quiz(
            "삼국을 통일한 신라의 왕은 누구일까요?",
            ["태종 무열왕", "진흥왕", "문무왕", "법흥왕"],
            3
        ),
        Quiz(
            "고려를 건국한 인물은 누구일까요?",
            ["왕건", "궁예", "견훤", "광종"],
            1
        ),
        Quiz(
            "훈민정음을 창제한 조선의 왕은 누구일까요?",
            ["태조", "정조", "영조", "세종"],
            4
        ),
        Quiz(
            "3·1 운동이 일어난 연도는 언제일까요?",
            ["1894년", "1905년", "1919년", "1945년"],
            3
        )
    ]
